balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F67K90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T7CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="T7CON" edc:nzwidth="8" edc:por="0000x000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR7ON" edc:desc="" edc:mask="0x1" edc:name="TMR7ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nT7SYNC" edc:desc="" edc:mask="0x1" edc:name="nT7SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7CKPS" edc:desc="" edc:mask="0x3" edc:name="T7CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR7CS" edc:desc="" edc:mask="0x3" edc:name="TMR7CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T7CKPS0" edc:desc="" edc:mask="0x1" edc:name="T7CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7CKPS1" edc:desc="" edc:mask="0x1" edc:name="T7CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR7CS0" edc:desc="" edc:mask="0x1" edc:name="TMR7CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR7CS1" edc:desc="" edc:mask="0x1" edc:name="TMR7CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR7" edc:desc="" edc:name="TMR7" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR7L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR7L" edc:nzwidth="8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR7L" edc:desc="" edc:mask="0xff" edc:name="TMR7L" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR7H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR7H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR7H" edc:desc="" edc:mask="0xff" edc:name="TMR7H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP10CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="CCP10CON" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP10M" edc:desc="" edc:mask="0xf" edc:name="CCP10M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC10B" edc:desc="" edc:mask="0x3" edc:name="DC10B" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP10M0" edc:desc="" edc:mask="0x1" edc:name="CCP10M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10M1" edc:desc="" edc:mask="0x1" edc:name="CCP10M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10M2" edc:desc="" edc:mask="0x1" edc:name="CCP10M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10M3" edc:desc="" edc:mask="0x1" edc:name="CCP10M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC10B0" edc:desc="" edc:mask="0x1" edc:name="DC10B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC10B1" edc:desc="" edc:mask="0x1" edc:name="DC10B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP10Y" edc:desc="" edc:mask="0x1" edc:name="CCP10Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10X" edc:desc="" edc:mask="0x1" edc:name="CCP10X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR10" edc:desc="" edc:name="CCPR10" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR10L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR10L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR10L" edc:desc="" edc:mask="0xff" edc:name="CCPR10L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR10H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR10H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR10H" edc:desc="" edc:mask="0xff" edc:name="CCPR10H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP9CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="CCP9CON" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP9M" edc:desc="" edc:mask="0xf" edc:name="CCP9M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC9B" edc:desc="" edc:mask="0x3" edc:name="DC9B" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP9M0" edc:desc="" edc:mask="0x1" edc:name="CCP9M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9M1" edc:desc="" edc:mask="0x1" edc:name="CCP9M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9M2" edc:desc="" edc:mask="0x1" edc:name="CCP9M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9M3" edc:desc="" edc:mask="0x1" edc:name="CCP9M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC9B0" edc:desc="" edc:mask="0x1" edc:name="DC9B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC9B1" edc:desc="" edc:mask="0x1" edc:name="DC9B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP9Y" edc:desc="" edc:mask="0x1" edc:name="CCP9Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9X" edc:desc="" edc:mask="0x1" edc:name="CCP9X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR9" edc:desc="" edc:name="CCPR9" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR9L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR9L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR9L" edc:desc="" edc:mask="0xff" edc:name="CCPR9L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR9H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR9H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR9H" edc:desc="" edc:mask="0xff" edc:name="CCPR9H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CCP8CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="CCP8CON" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP8M" edc:desc="" edc:mask="0xf" edc:name="CCP8M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC8B" edc:desc="" edc:mask="0x3" edc:name="DC8B" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP8M0" edc:desc="" edc:mask="0x1" edc:name="CCP8M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8M1" edc:desc="" edc:mask="0x1" edc:name="CCP8M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8M2" edc:desc="" edc:mask="0x1" edc:name="CCP8M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8M3" edc:desc="" edc:mask="0x1" edc:name="CCP8M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC8B0" edc:desc="" edc:mask="0x1" edc:name="DC8B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC8B1" edc:desc="" edc:mask="0x1" edc:name="DC8B1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CCP8Y" edc:desc="" edc:mask="0x1" edc:name="CCP8Y" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8X" edc:desc="" edc:mask="0x1" edc:name="CCP8X" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR8" edc:desc="" edc:name="CCPR8" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR8L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CCPR8L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CCPR8L" edc:desc="" edc:mask="0xff" edc:name="CCPR8L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
