balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F67K90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA19" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA19" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S08C3" edc:desc="" edc:mask="0x1" edc:name="S08C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C3" edc:desc="" edc:mask="0x1" edc:name="S09C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C3" edc:desc="" edc:mask="0x1" edc:name="S10C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C3" edc:desc="" edc:mask="0x1" edc:name="S11C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C3" edc:desc="" edc:mask="0x1" edc:name="S12C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C3" edc:desc="" edc:mask="0x1" edc:name="S13C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C3" edc:desc="" edc:mask="0x1" edc:name="S14C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C3" edc:desc="" edc:mask="0x1" edc:name="S15C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA20" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA20" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C3" edc:desc="" edc:mask="0x1" edc:name="S16C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C3" edc:desc="" edc:mask="0x1" edc:name="S17C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C3" edc:desc="" edc:mask="0x1" edc:name="S18C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C3" edc:desc="" edc:mask="0x1" edc:name="S19C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C3" edc:desc="" edc:mask="0x1" edc:name="S20C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C3" edc:desc="" edc:mask="0x1" edc:name="S21C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C3" edc:desc="" edc:mask="0x1" edc:name="S22C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C3" edc:desc="" edc:mask="0x1" edc:name="S23C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA21" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LCDDATA21" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S24C3" edc:desc="" edc:mask="0x1" edc:name="S24C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C3" edc:desc="" edc:mask="0x1" edc:name="S25C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C3" edc:desc="" edc:mask="0x1" edc:name="S26C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C3" edc:desc="" edc:mask="0x1" edc:name="S27C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C3" edc:desc="" edc:mask="0x1" edc:name="S28C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C3" edc:desc="" edc:mask="0x1" edc:name="S29C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C3" edc:desc="" edc:mask="0x1" edc:name="S30C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C3" edc:desc="" edc:mask="0x1" edc:name="S31C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="LCDDATA22" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------x" edc:name="LCDDATA22" edc:nzwidth="8" edc:por="-------x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C3" edc:desc="" edc:mask="0x1" edc:name="S32C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EECON2" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="EECON2" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EECON2" edc:desc="" edc:mask="0xff" edc:name="EECON2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="EECON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx-xxxxx" edc:name="EECON1" edc:nzwidth="0x8" edc:por="xx-0x000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="" edc:mask="0x1" edc:name="FREE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CFGS" edc:desc="" edc:mask="0x1" edc:name="CFGS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EEPGD" edc:desc="" edc:mask="0x1" edc:name="EEPGD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
